Autodesk.Revit.DB.Structure.FabricSheet.IsSingleFabricSheetWithinHost(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Transform)
Identifies if the specified single Fabric Sheet position is within the host.
hostElement:
A structural element that will host the Fabric Sheet.
transform:
The transform that defines the placement of the instance single Fabric Sheet.
Returns:
True if the single Fabric Sheet instance is within the host, false if the single Fabric Sheet instance is out of host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.IsCoverOffsetValid(System.Double)
Identifies if the specified value is valid for use as a cover offset.
Remarks:
The cover offset must be less than or equal to the host thickness.
coverOffset:
The cover offset value.
Returns:
True if the value is valid, false if the value is invalid.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.SetSegmentLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the bent fabric sheet segment(like A, B, C, D etc.)
segmentParameterId:
The segment ID of the bent fabric sheet.
value:
The length value to set
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not a number
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheet.GetSegmentParameterIdsAndLengths(System.Boolean)
Returns the array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.).
Remarks:
This method does not provide alphabetical nor any other order of returned parameters.
rounded:
Set to true to return rounded values for segments lengths.
Returns:
Array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.) is returned for bend fabric sheet.
For flat fabric sheet (not bent) empty array is returned.
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheet.SetBendProfile(Autodesk.Revit.DB.CurveLoop)
Sets new profile that defines the shape of the Fabric Sheet bending.
bendProfile:
A profile that defines the bending shape of the fabric sheet.
The profile can be provided without fillets (eg. for L shape, only two lines not two lines and one arc), if so,
then fillets (in example one arc) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family.
If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated.
The provided profile defines the center-curve of a wire.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the bend profile contains an overlap or intersecting segments.
-or-
Thrown when the bend profile is empty.
-or-
Thrown when the bend profile contains an empty loop.
-or-
Thrown when the bend profile contains multiple loops.
-or-
Thrown when the bend profile contains a closed loop.
-or-
Thrown when the bend profile contains two or more arcs that are not separated from one another by a straight segment.
-or-
Thrown when the bend profile contains too short segments which prevent the fillets from being added. The fillet radius is taken from Bend Diameter parameter defined in the Fabric Wire system family.
-or-
Thrown when the provided profile cannot be used as a bending shape for this fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.GetBendProfile
Returns the profile (not including generated fillets) that defines the shape of the Fabric Sheet bending.
Remarks:
The returned profile defines the center-curve of a wire.
Note that bent Fabric Sheets can have planar geometry, but flat Fabric Sheets are always planar.
Returns:
The profile that defines the shape of the fabric sheet bending for bent fabric sheet, for flat fabric sheet null will be returned.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.GetBendProfileWithFillets
Returns the profile with generated fillets that defines the shape of the Fabric Sheet bending.
Remarks:
Returned curve loop is created automatically as a result of adding fillets to bend profile.
The returned profile defines the center-curve of a wire.
Note that bent Fabric Sheets can have planar geometry, but flat Fabric Sheets are always planar.
Returns:
The bend profile with generated fillets that defines the shape of the fabric sheet bending for bent fabric sheet,
for flat fabric sheet null will be returned.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.GetReinforcementRoundingManager
Returns an object for managing reinforcement rounding override settings.
Returns:
The rounding manager.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.FabricSheet.GetSheetLocation
Gets the position and the orientation of the Fabric Sheet instance.
Returns:
The location of the Fabric Sheet instance.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.IsValidHost(Autodesk.Revit.DB.Element)
Checks whether an element is a valid host for fabric sheet.
host:
The element to check.
Returns:
True if the element is a valid host for fabric sheet, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.IsValidHost(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether an element is a valid host for fabric sheet.
document:
The document.
concreteHostElementId:
The elementId to check.
Returns:
True if the element is a valid host for fabric sheet, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.PlaceInHost(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Transform)
Inserts the single Fabric Sheet instance into the host element.
hostElement:
A structural element that will host the Fabric Sheet. The element must support fabric hosting.
transform:
The transform that defines the placement of the instance single Fabric Sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The host Element is not a valid host for Fabric Sheet.
-or-
transform defines the placement out of the host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.GetWireCenterlines
Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
Returns:
The centerline curves.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.GetWireCenterlines(Autodesk.Revit.DB.Structure.WireDistributionDirection)
Gets a list of curves representing the wires centerlines of the Fabric Sheet.
wireDirection:
The direction of wire distribution in the Fabric Sheet.
Returns:
The centerline curves.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CurveLoop)
Creates a new instance of a single bent Fabric Sheet element within the project.
document:
The document in which the fabric sheet is to be created.
concreteHostElementId:
The element that will host the FabricSheet.
The host can be a Structural Floor, Structural Wall, Structural Slab, Structural Floor Edge, Structural Slab Edge,
Structural Column, Beam and Brace.
Also, host can be a Autodesk::Revit::DB::Part created from a structural layer of Structural Floor, Structural Wall or Structural Slab.
fabricSheetTypeId:
The id of the FabricSheetType.
bendProfile:
A profile that defines the bending shape of the fabric sheet.
The profile can be provided without fillets (eg. for L shape, only two lines not two lines and one arc), if so,
then fillets (in example one arc) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family.
If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated.
The provided profile defines the center-curve of a wire.
Returns:
The instance of the newly created bent fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
concreteHostElementId is not a valid ElementId for the host Fabric Sheet.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
-or-
Thrown when the bend profile contains an overlap or intersecting segments.
-or-
Thrown when the bend profile is empty.
-or-
Thrown when the bend profile contains an empty loop.
-or-
Thrown when the bend profile contains multiple loops.
-or-
Thrown when the bend profile contains a closed loop.
-or-
Thrown when the bend profile contains two or more arcs that are not separated from one another by a straight segment.
-or-
Thrown when the bend profile contains too short segments which prevent the fillets from being added. The fillet radius is taken from Bend Diameter parameter defined in the Fabric Wire system family.
-or-
Thrown when the provided profile cannot be used as a bending shape for this fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId)
Creates a new instance of a single flat Fabric Sheet element within the project.
document:
The document in which the fabric sheet is to be created.
hostElement:
The element that will host the FabricSheet. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
fabricSheetTypeId:
The id of the FabricSheetType.
Returns:
The newly created single Fabric Sheet instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElement was not found in the given document.
-or-
The host Element is not a valid host for Fabric Sheet.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.CutOverallWidth
The sheet length after cutting has taken place.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.CutOverallLength
The sheet length after cutting has taken place.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.FabricNumber
Specifies the numerical parameter assigned to the fabric sheet and any sheet of the same type, dimension, material, shape, and partition.
Remarks:
Value of this property corresponds to the Fabric Number parameter of Rebar as available in both the UI and API. Refer to the NumberingSchema class for details related to numbering Rebar and Fabrics.
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheet.FabricHostReference
Controls if Single Fabric Sheet should be cut by the Host Cover
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.CoverOffset
The additional cover offset of the Fabric Sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for coverOffset is not a number
-or-
When setting this property: coverOffset is greater then the host thickness.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for coverOffset must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.FabricLocation
The Fabric Sheet location in the host.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.FabricAreaOwnerId
The Fabric Area Id.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.CutSheetMass
The sheet mass after cutting has taken place.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.HostId
The structure element that contains the Fabric Sheet.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.IsBent
The type of fabric sheet. True for bent fabric sheet, false for flat fabric sheet.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.SketchId
The id of the Sketch element for this element.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.BendFinalLoopOrientationVector
Direction of local Fabric Sheet Y axis in bending polyline LCS.
Remarks:
Note that bending line may be rotated before it is placed in Fabric Sheet local coordinate system.
This vector allows to calculate rotation angle or Trf.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricLongitudinalCutLength
Specifies the cut length of the fabric sheet perpendicular to the bend edge.
Remarks:
Zero indicates that the fabric sheet is not shortened.
This parameter applies only to bent fabric sheets.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for bentFabricLongitudinalCutLength must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricStraightWiresLocation
Specifies the location of straight bars with respect to bent bars in the fabric sheet.
Remarks:
This parameter applies only to bent fabric sheets.
The side on wich straight wires will be loacted is determined by the start and end point of the first bent profile segment that specifies the direction of the curve loop on plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricBendDirection
Specifies which wire direction of the fabric sheet is bent.
Remarks:
This parameter applies only to bent fabric sheets.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet
An object that represents an Fabric Sheet Element within the Autodesk Revit project.
Remarks:
Beginning with Revit 2016, fabric sheets can be either flat or bent.
Both kinds of fabric sheets are implemented by this FabricSheet class.
Fabric sheets are created as either flat or bent. Once created, the kind of a fabric sheet cannot be changed.
The Fabric Sheet element is available only in the Autodesk Revit Structure product.
Since:
2013